[
  {
    "id": 1,
    "movie_name": "THE LOST CITY",
    "movie_year": 2022,
    "movie_director": "Adam Nee, Aaron Nee",
    "movie_description": "“The Lost City” isn’t an especially unique film; its premise draws on “Romancing the Stone” and countless other adventure movies. Its punchlines are recognizable from a distance as the volcano dominating the remote island where most of the story takes place. This is a movie you can get a clear sense of from its opening moments, every beat clearly telegraphed.\n\nThere is, however, a significant amount of comfort and delight in all this familiarity. Directors and co-writers Adam and Aaron Nee understand exactly what their audience wants—much like a good romance novelist might—and deliver an undeniably charming (and refreshingly IP-free) romantic romp. This is a movie you watch in the theater, with popcorn, then again and again on streaming, with a glass of wine.\n\nLoretta Sage (Sandra Bullock) is a burnt-out romance writer whose grief after the loss of her husband threatens to derail her career. Her disdain for her books is only matched by her dislike of their cover model, Alan (Channing Tatum), a seemingly dim beefcake who indulges her readers at signing events.\n\nAfter an event promoting her latest book, Loretta is abducted by explorer/rich guy Abigail (it’s a gender-neutral name, apparently) Fairfax, played by Daniel Radcliffe. Fairfax knows that the lost city from Loretta’s book is real, and he wants her to translate some ancient writing that leads to a treasure before a volcano erupts and covers the whole thing. Alan mounts an ill-advised expedition to save Loretta, with help from his meditation guru, Jack (Brad Pitt), and Loretta’s beleaguered editor Beth (Da’Vine Joy Randolph).\n\nLoretta and Alan’s eventual romance is unavoidable, but “The Lost City” does a great job exploring the mounting chemistry between Bullock and Tatum’s characters. In particular, the movie highlights Alan’s emotional intelligence and unwavering support. He may be the kind of guy who refers to Loretta as a “human mummy,” but he also knows she gets cranky without snacks, and that she could use a slightly more sensible pair of shoes traversing all that rocky terrain. Like many a beloved romantic hero, Alan is not only a gorgeous man, he’s a man who cares.\n\nTatum is great casting for a role like this on several levels; not only does he look like he belongs on the cover of a romance paperback, he’s also an actor who understands his own appeal and has proven time and again that he isn’t afraid to play it for laughs. Bullock is also more than happy to play into her character’s physical awkwardness and eventual shedding of her prickly exterior—it’s not exactly unfamiliar territory for her, either. Together, the pair exude fun and a sense of affection that’s easy to get caught up in.\n\nOther members of the supporting cast, particularly a very welcome Patti Harrison as Loretta’s hysterically self-involved social media manager, add bright, bizarre punches of humor to a script that otherwise plays it by the numbers (oddly, this isn’t a criticism, “The Lost City” is working with an effective formula). Radcliffe is the only element of the movie that doesn’t work quite as well as the rest. His character is the one area where the film tries to change up established archetypes, and the result is that he feels out of place in a story where everyone else comfortably fits into their roles.\n\n“The Lost City” may get dinged by some for being formulaic and silly, but it does many things well that are notable. It’s bright, both visually and atmospherically. It’s an original story, told by filmmakers who get what kind of movie this is. Most importantly, its central relationship displays a real understanding of the emotional sensitivity and vulnerability that make romance attractive as a genre. Ultimately, “The Lost City” is interested in hitting viewers’ expectations head on. It does so on a level that may seem obvious, but is done with an amount of care that’s sure to hold up to repeat viewings.\n\nThis review was filed from the SXSW Film Festival. The film opens on March 25th.",
    "image_url": "https://resizing.flixster.com/wFWZpHfLtrUA49MyGXNl2X80Chs=/fit-in/180x240/v2/https://resizing.flixster.com/s1V-vHPMVvDmhQsDcoprzMiXZFQ=/ems.ZW1zLXByZC1hc3NldHMvbW92aWVzL2ExNDVlZGU0LTJkMTMtNDVkZS1iYTkyLTEzNzllNDI2NWUzNi5qcGc="
  },
  {
    "id": 2,
    "movie_name": "THE BATMAN",
    "movie_year": 2022,
    "movie_director": "Dylan Clark; Matt Reeves",
    "movie_description": "Matt Reeves’ “The Batman” isn’t a superhero movie. Not really. All the trappings are there: the Batmobile, the rugged suit, the gadgets courtesy of trusty butler Alfred. And of course, at the center, is the Caped Crusader himself: brooding, tormented, seeking his own brand of nighttime justice in a Gotham City that’s spiraling into squalor and decay.\n\nBut in Reeves’ confident hands, everything is breathtakingly alive and new. As director and co-writer, he’s taken what might seem like a familiar tale and made it epic, even operatic. His “Batman” is more akin to a gritty, ‘70s crime drama than a soaring and transporting blockbuster. With its kinetic, unpredictable action, it calls to mind films like “The Warriors” as well as one of the greatest of them all in the genre, “The French Connection.” And with a series of high-profile murders driving the plot, it sometimes feels as if the Zodiac killer is terrorizing the citizens of Gotham.\n\nAnd yet, despite these touchstones, this is unmistakably a Matt Reeves film. He accomplishes here what he did with his gripping entries in the “Planet of the Apes” franchise: created an electrifying, entertaining spectacle, but one that’s grounded in real, emotional stakes. This is a Batman movie that’s aware of its own place within pop culture, but not in winking, meta fashion; rather, it acknowledges the comic book character’s lore, only to examine it and reinvent it in a way that’s both substantial and daring. The script from Reeves and Peter Craig forces this hero to question his history as well as confront his purpose, and in doing so, creates an opening for us as viewers to challenge the narratives we cling to in our own lives.\n\nAnd with Robert Pattinson taking over the role of Bruce Wayne, we have an actor who’s not just prepared but hungry to explore this figure’s weird, dark instincts. This is not the dashing heir to a fortune prowling about, kicking ass in a cool costume. This is Travis Bickle in the Batsuit, detached and disillusioned. He’s two years into his tenure as Batman, tracking criminals from on high in Wayne Tower—an inspired switch from the usual sprawl of Wayne Manor, suggesting an even greater isolation from society. “They think I’m hiding in the shadows,” he intones in an opening voiceover. “But I am the shadows.” In the harsh light of day, Pattinson gives us hungover indie rock star vibes. But at night, you can see the rush he gets from swooping in and executing his version of vengeance, even beneath the tactical gear and eye black.\n\nAs he’s shown in pretty much every role he's taken since “Twilight” made him a global superstar in 2008, working with singular auteurs from David Cronenberg to Claire Denis to the Safdie brothers, Pattinson is at his best when he’s playing characters who make you uncomfortable. Even more than Christian Bale in the role, Pattinson is so skilled at making his beautiful, angular features seem unsettling. So when he first spies on the impossibly sexy Zoe Kravitz as Selina Kyle, slinking into her leather motorcycle gear and shimmying down the fire escape in her own pursuit of nocturnal justice, there’s an unmistakable flicker of a charge in his eyes: Ooh. She’s a freak like me.\n\nPattinson and Kravitz have insane chemistry with each other. She is his match, physically and emotionally, every step of the way. This is no flirty, purring Catwoman: She’s a fighter and a survivor with a loyal heart and a strong sense of what’s right. Following her lead role in Steven Soderbergh’s high-tech thriller “Kimi,” Kravitz continues to reveal a fierce charisma and quiet strength.\n\nShe’s part of a murderer’s row of supporting performers, all of whom get meaty roles to play. Jeffrey Wright is the rare voice of idealism and decency as the eventual Commissioner Gordon. John Turturro is low-key chilling as crime boss Carmine Falcone. Andy Serkis—Caesar in Reeves’ “Apes” movies—brings a paternal wisdom and warmth as Alfred. Colin Farrell is completely unrecognizable as the sleazy, villainous Oswald Cobblepot, better known as The Penguin. And Paul Dano is flat-out terrifying as The Riddler, whose own drive for vengeance provides the story’s spine. He goes to extremes here in a way that’s reminiscent of his startling work in “There Will Be Blood.” His derangement is so intense, you may find yourself unexpectedly laughing just to break the tension he creates. But there’s nothing amusing about his portrayal; Dano makes you feel as if you’re watching a man who’s truly, deeply disturbed.\n\nThis is not to say that “The Batman” is a downer; far from it. Despite the overlong running time of nearly three hours, this is a film that’s consistently viscerally gripping. The coolest Batmobile yet—a muscular vehicle that’s straight out of “Mad Max: Fury Road”—figures prominently in one of the movie’s most heart-pounding sequences. It’s an elaborate car chase and chain-reaction crash ending with an upside-down shot of fiery fury that literally had me applauding during my screening. During a fight at a thumping night club, punctuated by pulsating red lights, you can feel every punch and kick. (That’s one of the more compelling elements of seeing this superhero in his early days: He isn’t invincible.) And a shootout in a pitch-black hallway, illuminated only by the blasts of shotgun fire, is both harrowing and dazzling. Greatly magnifying the power of scenes like these is the score from veteran composer Michael Giacchino. Best known for his Pixar movie music, he does something totally different with “The Batman”: percussive and horn-heavy, it is massive and demanding, and you will feel it deep in your core.\n\nWorking with artists and craftspeople operating at the top of their game, Reeves has made a movie that manages to be ethereal yet weighty at the same time, substantial yet impressionistic. Cinematographer Greig Fraser pulls off the same sort of stunning magic trick he did with his Oscar-nominated work in Denis Villeneuve’s “Dune”: Through pouring rain and neon lights, there’s both a gauziness and a heft to his imagery. His use of shadow and silhouette is masterful, and does so much to convey a sense of foreboding and tension. I could write an entire, separate essay on the film’s many uses of the color red to suggest energy, danger, even hope. And the costume design from the great Jacqueline Durran—with Dave Crossman and Glyn Dillon designing Pattinson’s rough-and-tumble Batsuit—put just the right finishing touch on the film’s cool, edgy vibe.\n\nThis is the most beautiful Batman movie you’ve ever seen—even if it’s not really a Batman movie at all.",
    "image_url": "https://resizing.flixster.com/-fJAolsN7DX3qfNWcyUeeWrloD8=/fit-in/180x240/v2/https://resizing.flixster.com/z7Qex7L7ZUT1YdAwuJ49BEulml4=/ems.ZW1zLXByZC1hc3NldHMvbW92aWVzLzc1OGFlMDI0LTE1ZTEtNDE4ZS04Y2RmLWNjYzcyOWQyZmMyNi5qcGc="
  },
  {
    "id": 3,
    "movie_name": "WHO WE ARE: A CHRONICLE OF RACISM IN AMERICA",
    "movie_year": 2022,
    "movie_director": "Emily Kunstler, Sarah Kunstler",
    "movie_description": "“We have decided to move into our house because my father—my father—he earned it for us, brick by brick.”—Walter Lee Younger (Sidney Poitier) in Lorraine Hansberry’s masterpiece, “A Raisin in the Sun”\n\nA recurring visual utilized by speaker Jeffery Robinson in Emily and Sarah Kunstler’s sobering documentary, “Who We Are: A Chronicle of Racism in America” is that of a ball reaching a tipping point, mere centimeters away from achieving real progress until it is forced to slide backward. One of the key historical instances of this recurring setback is the assassination of Dr. Martin Luther King, Jr., which occurred in Robinson’s hometown of Memphis, Tennessee, before the civil rights leader had the chance to deliver a speech entitled, “Why America May Go to Hell.” Soon afterward, the homes in the Black neighborhood where Robinson’s family lived were bought up, prompting his father to make a deal with the developer. This resulted in Robinson’s family, not unlike the one in Hansberry’s play, purchasing a new house in a white community, thus ensuring that he and his brother would receive the good Catholic education their parents desired for them. Robinson vividly recalls how their next door neighbor was about to bring them his cherished dessert of chocolate chip cookies, until she realized that his family was not, in fact, “the help.”\n\nIt was his “unicorn parents” combined with pure luck that Robinson credits for the road that led him to graduate from Harvard Law School and serve as a deputy legal director of the ACLU. Despite receiving the best schooling that the American education system could offer, Robinson was shocked by just how much was left out of the history books, thus inspiring his titular one man show, which we see him performing on Juneteenth 2018 at New York City’s Town Hall Theater. Just as Al Gore detailed the inconvenient truth of global warming and the devastating impact it is currently having on our planet, Robinson is sharing a mightily uncomfortable one that the subsequent years have only magnified. Both “An Inconvenient Truth” and “Who We Are” call for urgent foundational changes in how we live our lives, and neither film is the dry lecture it might seem to be upon initial glance. Robinson is matter-of-fact, thoughtful and enormously compelling in illustrating hidden chapters of our shared history, such as the 1921 ethnic cleansing in Tulsa, which many people first heard of thanks to HBO’s brilliant 2019 series, “Watchmen,” with its bold yellow lettering that was later echoed in Black Lives Matter street art. \n\nEmily Kunstler’s editing effectively juxtaposes Robinson’s presentation with footage of him visiting subjects in various corners of the country, including the delightful Lessie Benningfield Randle, a 107-year-old survivor of the violence in Tulsa, which was sparked by the attempt of citizens in Greenwood, an enclave dubbed “Black Wall Street,” to prevent a lynching. Only the steps to the city remain, a chilling reminder of a trailblazing community that was never rebuilt. Robinson argues that such atrocities, including the estimated 4,000 racial lynchings that occurred in the century following emancipation, could only have been allowed as a result of “acquiescence or direct involvement” on the part of law enforcement. His observation that modern day police departments were originally formed as slave patrols serves as a segue to his interview with the mother of Eric Garner, who believes her son to be a sacrificial lamb. His murder at the hands of officers is one of countless modern tragedies that affirm how the law relieving the killing of an enslaved person from being deemed a felony is still being upheld. \n\nThe film is guaranteed to leave you questioning why a slaveholder like Andrew Jackson remains on the $20 bill, why Francis Scott Key’s “Star-Spangled Banner”—a verse of which celebrates the murder of enslaved people—is our national anthem and why the request for reparations are ever questioned, especially in light of Lincoln’s Compensated Emancipation Act, which compensated slaveholders to the tune of $1 million for their “lost property.” One of my favorite images in the film is that of a few appropriately withered flower bouquets sympathetically affixed in the fence surrounding the space where a statue of Confederate General Nathan Bedford Forrest was removed, thanks to the efforts of activist Tami Sawyer. Robinson reminds us that John Ehrlichman of the Nixon administration did not mince words when admitting that the notorious “war on drugs” was simply meant to disrupt communities that the government felt was a threat, linking hippies with marijuana and Blacks with heroin. What prevents this film’s stomach-churning history lesson from numbing our senses is Robinson’s ability to make himself a vulnerable human presence on camera, such as when he admits to being disappointed by his own results in Harvard’s Implicit Association Test, which indicated that he has a negative impression of Black men like himself. \n\nAn emotional highpoint of the picture occurs during Robinson’s trip back to his former St. Louis Memphis Catholic School, where he and his brother became the first Black students to be enrolled there. His former basketball coach, Richard Orians, tearfully recounts how he attempted to protect Robinson from the racist vitriol being voiced in Walls, Mississippi, after they travelled there for a game. Robinson even gives a Confederate Flag-waving man in South Carolina the chance to state his case, thus removing any shadow of a doubt that his convictions have trumped any threat of knowledge. Viewers who are skeptical that white supremacy is being normalized in U.S. classrooms should look no further than the proposed Indiana State Senate Bill 167, which removes the right of instructors to teach that the Nazis and similar political parties are “of a low moral character.” “Who We Are” should be made required viewing in every American school as we find ourselves perched, once again, at a pivotal tipping point. The hope found in activists of all races demonstrating together in the midst of a pandemic is underlined by the joyous gospel music over the end credits. It is Robinson’s aim to guide our eye in seeing the truth of our past that is so often overlooked. This is perhaps most indelibly expressed by the fingerprints left in walls throughout Charleston by the enslaved people who built our cities, our economy and our country, brick by brick.",
    "image_url": "https://resizing.flixster.com/gC-kUhAfyCA5Lv4qTan-k0m8ARU=/fit-in/180x240/v2/https://resizing.flixster.com/qIio9PVgz88FvAhg-AcddXp6hJI=/ems.ZW1zLXByZC1hc3NldHMvbW92aWVzLzIxYjczNTFmLWQ0NjAtNDg3Zi04MzNlLTlmZDE3NWU0NjVmZC5qcGc="
  },
  {
    "id": 4,
    "movie_name": "X",
    "movie_year": 2022,
    "movie_director": "Ti West",
    "movie_description": "Halfway through Ti West’s “X,” a ragtag gang of porno filmmakers, including high-minded director RJ (Owen Campbell) and his shy girlfriend/sound girl Lorraine (Jenna Ortega) face a challenge. Lorraine’s been watching their movie’s stars perform sex acts for the camera all day, and announces, to everyone’s surprise, that she’d like to give it a shot. An annoyed RJ tells Lorraine they’re too far into the story. Adding her in would change their movie’s whole direction.\n\n“What about 'Psycho'?” Lorraine asks, reminding RJ that Hitchcock’s movie introduces a new set of protagonists halfway through. “Psycho” is horror, RJ says, and they’re not making a horror film. They’re making porn. Of course, our characters are about to learn they are part of a horror picture. They just happen to be living it, not making it.\n\nThis scene and its mounting meta-commentary describe \"X\"'s reason for being in a nutshell: it’s an icky good time that's primarily a love letter to the filmmaking process. Structural shifts and tonal sleight-of-hand are part of its self-referential approach. \"X\" is a clever formal experiment, but one that plays like a feature-length joke for horror fans and filmmakers rather than offering a distinct perspective. West conjures nasty fun with a genre enthusiast’s expertise and then doesn't offer much beyond that.\n\nThe grist for this gory, sexy mill comes in the form of would-be adult film empresario Wayne (Martin Henderson), his girlfriend Maxine (Mia Goth), burlesque dancer Bobby-Lynne (Brittany Snow), and Bobby-Lynne’s boyfriend/co-star Jackson (Scott “Kid Cudi” Mescudi), in addition to RJ and Lorraine. It’s 1979, and Wayne has booked the crew space on a farm outside Houston to shoot their movie “The Farmer’s Daughters,” which he expects will be a hit on the emerging home video market.\n\nWayne’s chosen location is a rickety, creepy cabin owned by Howard (Stephen Ure), an old coot who disapproves of Wayne and his crew. Howard’s invalid wife Pearl, whose impressive casting I won’t reveal, envies the group’s youth and virility, and is particularly drawn to the determined-but-insecure Maxine. Anyone picking up “The Texas Chain Saw Massacre” vibes or making note of RJ and Lorraine’s “Psycho” discussion can see where this is headed. Suffice it to say that as evening descends, the body count rises. \n\nWest delights in the atmosphere of his setting and the historical hallmarks of the lurid sandboxes he’s playing in. His knowledge and humor is evident in Maxine’s Linda Lovelace-inspired hair and makeup, the swampy, sweaty heat of the film’s coastal Texas locale, and Jackson’s baby-blue leisure suit and perfect afro.\n\nThe film crew’s “let’s-put-on-a-show” ethos highlights the plucky, hard-fought joys of low-budget filmmaking, recalling movies like “Ed Wood” or “Dolemite is My Name.” When the focus switches to out-and-out horror, the source of “X’s” enthusiasm and devotion also changes. Instead of the characters being energized by the ad-hoc creative process, it’s West himself who radiates excitement, nearly becoming an off-camera character as “X” gleefully picks off its filmmaker proxies one by one.\n\nBut “X” never goes deeper than these visceral pleasures. There are hints at an even weirder potential storyline, or themes about the commodification of youth and beauty. None of this goes beyond suggestion. Howard and Pearl particularly feel like missed opportunities, plopped into genre stereotypes and ignoring the economic and cultural undercurrents which helped make the Sawyer family of \"Texas Chain Saw Massacre\" and Norman Bates of \"Psycho\" so iconic.\n\n“X” is all about having a good time and relishing the hard work, dedication, and satisfaction of independent filmmaking, regardless of genre. That clear joy is admirable, but West’s ode to technical and artistic ingenuity undervalues the context that played a significant role in the success of the movies he so lovingly references. “X” is plenty of fun; it also feels like a trifle that could easily have been much more.\n\nThis review was filed from the 2022 SXSW Film Festival. The film opens on March 18th.",
    "image_url": "https://resizing.flixster.com/9wzrpkRBloiyoxKK74AczHEZ_5s=/fit-in/180x240/v2/https://resizing.flixster.com/hwvY1YI3nRJtDcBhyCfvMmdBrVk=/ems.ZW1zLXByZC1hc3NldHMvbW92aWVzLzI5Y2VlMDIwLTJhMTgtNDAwOC05YTZkLTFkNWI1ZTQ2MGI4OC5qcGc="
  },
  {
    "id": 5,
    "movie_name": "HELLBENDER",
    "movie_year": 2022,
    "movie_director": "John Adams, Zelda Adams, Toby Poser",
    "movie_description": "Horror has always been a home for DIY filmmaking. There’s something magical about a group of like-minded people who go into the woods and come out with a work of art. Sometimes it’s “The Evil Dead” or “Last House on the Left.” These films are acts of rebellious expression, reclamations of the genre from a studio system that has often misunderstood it. One of the most fascinating horror DIY collectives in recent years has been the Adams family (not Morticia and Gomez). An upstate New York family who writes, directs, stars, and does just about everything else in their movies, the Adams clan broke through with “The Deeper You Dig,” a surreal, must-see flick that’s now on Shudder. They returned to fests in 2021 with “Hellbender,” which lands on the streaming service today and continues their upward trajectory. These folks make daring, confident genre films, and they’re only getting better.\n\nOne of the reasons is that they’re becoming stronger performers. In “Hellbender,” Zelda Adams is legitimately great as Izzy, a young woman who has been raised away from civilization. Mother, who never gets a name and is played by Zelda’s mom and co-writer/co-director Toby Poser, has told Izzy that she’s sick—as they will in the horror genre for years to come, isolation and illness could reflect pandemic themes if you so choose. She never allows Izzy to leave their tree-shrouded home on the mountain, going into town for supplies on her own. Of course, Izzy is 16, and she’s starting to get tired of being alone. She loves playing in a badass punk band with her mom but wants to spread her wings. A prologue with a witch being very hard to kill and some other signs of occult imagery makes it clear there’s more going on here than a protective mother.\n\nThe first half of “Hellbender” echoes “Carrie” in its religion-tinged unpacking of a mother/daughter dynamic, but one of the things I love about the Adams family is how they veer left just when you think you know what direction they’re going. “Hellbender” initially feels very familiar—another story wherein female adolescence and something malevolent intersect—but then the Adams clan (which also includes Toby’s husband John and their other daughter Lulu, who also co-star) embrace their darker, punk rock side. Like “The Deeper You Dig,” “Hellbender” gets better as it gets more surreal, but this one has a nice balance to the out-there imagery in Zelda’s grounded, coming-of-age performance. I love the movies she’s making with her family, but I’d also really like to see what she could do with another director too. She’s got the range and potential.\n\nSo many DIY filmmakers are like pastiche artists, people who cobble together sequences and scripts from their favorite horror movies. What separates the work of the Adams family is the sense that while they know their genre, they’re never merely copying their predecessors. They’ve gone into the woods and come back with something that definitely fits in the legacy of what could be called “witch horror” but is also a film that only John, Toby, Lulu, and especially Zelda could have made. That's how you do it. I hope they go back into the woods again soon.\n\nOn Shudder today.\n\n",
    "image_url": "https://resizing.flixster.com/h5AIYr10PUUQIwjZs6REOxmmTpo=/fit-in/180x240/v2/https://resizing.flixster.com/Wp6gQcVHN1vg6Ii3F-XMLn_Dvns=/ems.ZW1zLXByZC1hc3NldHMvbW92aWVzLzljOTY4NjE5LWVhNTctNDNmYS05YTk4LWY1Y2Q5NzkyNTlmMy5qcGc="
  },
  {
    "id": 6,
    "movie_name": "LINGUI, THE SACRED BONDS",
    "movie_year": 2022,
    "movie_director": "Mahamat-Saleh Haroun",
    "movie_description": "There are a few recent movies that I wish I could’ve seen projected in a movie theater. Not just for their seductive wide-angle compositions or beautiful on-screen performers—an immersive sound design, sometimes based on a moving score, can also be transporting. I wondered what writer/director Mahamat-Saleh Haroun’s warm Chadian drama “Lingui, The Sacred Bonds” sounds like in a movie theater as I watched it on a desktop computer with noise-cancelling headphones. Sound designer Corinna Fleig does a lot to suggest the character of N’Djamena, Chad’s capital and the main setting of this slice-of-life drama about a mother and her pregnant teenage daughter.\n\nFleig and her team give a subtle, but vibrant sense to N’Djamena, and the soft buzz of motorcycles and field crickets gives viewers a clear sense of where this movie takes place. Haroun’s protagonists—anxious but withdrawn single mom Amina (Achouackh Abakar Souleymane) and her 15-year-old daughter Maria (Rihane Khalil Alio)—often struggle to articulate how they feel. But Amina and Maria always clearly communicate who they are, and Fleig’s sound design helps us understand how Haroun’s characters both resist and are shaped by their impassive, beautiful environment. \n\nAmina and Maria’s story has a low, but sustained level of emotional intensity that’s hinted at in the movie’s title. In the press notes, Haroun (“A Screaming Man”) explains that “Lingui” signifies a “bond or connection” that “implies solidarity” and “mutual aid.” Amina and Maria have this sort of unspoken—and mostly implied—relationship, though it’s not sentimentalized or over-stressed in any cloying way. Maria hates it when her mother calls her “Mamita,” and often says as much. And in one key scene, Amina tries to raise a million Central African francs (for her daughter’s illegal abortion) by offering herself to her overly familiar neighbor Brahim (Youssouf Djaoro). Haroun finds the drama in these interactions simply by showing us how life’s big moments are only spikes of emotional intensity. We watch Amina and Maria move with or against criss-crossing streams of car traffic, at the beginning and towards the end of the day; they struggle to maintain a connection between these episodic scenes.\n\nMuch of “Lingui” concerns little moments that can either develop into disappointment or hope for whatever comes next in the day. Haroun’s movie is not just about how Chadian women make do in a patriarchal society, though it is about that, too. Sometimes “Lingui” establishes its dramatic stakes by immersing us in the textures and tempo of Amina’s shapeless, but busy day, like when she strips tires and weaves metal wire into “kanoun” stoves, which she carries by hand (and on her head) across town. \n\nAnd sometimes “Lingui” reminds us that character reveals itself when you’re not paying attention. Amina begs her mother for an abortion by an open window, and the light from the partly shuttered frame creates a halo-like silhouette. Her mother also has a glow thanks to Haroun’s impressive collaboration with regular cinematographer Mathieu Giombini, but it’s nothing compared to the one surrounding Alio’s face after Maria’s told that “Muslims can’t do that.” “I don’t give a damn,” she replies. “Leave me, I don’t want it.”\n\nIt’s easy to imagine a movie like “Lingui” devolving into an overheated arthouse message movie given its focus on Maria’s desperate situation. It rarely does, despite a couple of distracting plot contrivances involving an insensitive Imam (Saleh Sambo) and Djaoro’s sleazy would-be suitor. More often than not, Haroun and his collaborators quietly mine their N’Djamena locations for their dramatic potential, like when Maria peeks around the corner of an alleyway as she trails after her mother. The camera moves with Alio’s head and shows us Amina sitting by herself, seemingly unaware (or unbothered) by Maria’s nearby presence. This is an evocative image that doesn’t really advance the story or its themes. It's just an incidental expression of longing that also shows you who these characters are to each other. No matter how the enveloping scene develops, this brief moment also illustrates what Haroun means when he says (again, in the movie’s press notes) that he aspires to reflect a kind of “social reality” through “banal scenes” that take on meaning “little by little.” \n\nFleig’s sound design also exemplifies Haroun’s subtle and often disarming focus on social realism. We track the steady shuffle of Amina’s sandals as she moves through a varied, but rarely overwhelming ambient soundscape. And as we tag along with Haroun’s characters, we learn to appreciate their story as a small, but vivid study of lives that are so much more than their progressive developments. I hope to revisit “Lingui” in a movie theater, if only so I can tune in again without covering my ears.",
    "image_url": "https://resizing.flixster.com/eQ3vlV1B9fR_4QfwitviMGRRElE=/fit-in/180x240/v2/https://resizing.flixster.com/sIM7TKOhZ_0JkHCHHByqJg-xhZY=/ems.ZW1zLXByZC1hc3NldHMvbW92aWVzLzIwNzdhYjRhLTNlODgtNGQ3Yi05NTNmLWFlOTMxYmJhYWYwNS5wbmc="
  },
  {
    "id": 7,
    "movie_name": "BELLE",
    "movie_year": 2022,
    "movie_director": "Mamoru Hosoda",
    "movie_description": "Mamoru Hosoda’s animated film “Belle,” a modern reimagining of “Beauty and the Beast,” sees an outcast by the name of Suzu (voiced by Kaho Nakamura), discovering community and love on a virtual reality platform called U. Through lush graphics, Hosoda’s fairytale charts the highs and lows of online stardom, and how we act out our innermost selves in the safety of an online world rather than at the behest of a crueler, realer universe. It’s a meticulously crafted, albeit not totally original critique of internet culture, bursting with color and melodramatic teen angst.  \n\nThe reserved, lonely Suzu lives in an idyllic countryside, where the bus line, following this summer, will soon be discontinued. Apart from school, where few take notice of her, U is her outlet to the outside world. The brainy, cynical Hiro (voiced by Ikura) is her best friend, her only friend. When she was a child, Suzu’s mother died while trying to save a stranded girl from a raging river. As a result, the now 17-year-old struggles to sing in public and is distant from her father. Only on U, where she becomes the radiant Belle, the platform’s most popular star, can she find the strength to sing.\n\nWe soon discover how Suzu is playing a role. See, every avatar on this body-sharing app is created from each user’s unique biometric information. When Suzu created her profile she uploaded a group picture that included Ruka (voiced by Tina Tamashiro), the most popular and attractive girl at her school, making Belle in her image. \n\nHosoda, in the early going of “Belle,” includes “Beauty and the Beast” references in simple ways. Suzu’s online popularity rises until a bruised, caped creature named The Dragon, followed by a cadre of authorities known as the Justices, barrels through her U concert. The justices, a band of muscular bullies dressed like superheroes, want to unveil The Dragon’s true identity because of the way he fights, seemingly punching opponents in the U’s Martial Arts Hall out of rage rather than sport. Sensing an inner-hurt that’s fueling him, Suzu becomes enamored with Dragon, and puts herself in direct opposition to the Justices.      \n\n“Belle” wraps the classic myth in familiar tropes concerning teenagers navigating high school crushes: Suzu’s childhood friend, the handsome and popular Shinobu (voiced by Ryô Narita), for instance, is one such flame whose warmth always seems just out of reach (it doesn’t help that he nauseatingly sees himself as her protector when she doesn’t need one). Any commentary the film tries to give about online culture never rises above the common: The internet exists for some as a therapeutic repository for healing pain and loss, and a toxic landscape for gripes and bullies.  \n\nRather the draw of “Belle” is its lush animation. At times, it’s cartoonish; in others, it’s hyper-realistic. At most points, the aesthetics morph into fantastical and whimsical shapes. Some images lodge in your brain like a rainbow on a puddle: The modern, virtual recreation of the Beast’s castle, a kind of crystal palace is one. Belle, adorned in a flowing rose-colored dress, singing atop a whale mounted with speakers as millions of avatars in all shapes and sizes surround her, represent another. The most sincere scene: A golden glittering sea of voices outstretched in pure kindness, featuring Suza’s best song, in a movie composed of an ocean of plaintive melodies.  \n\nThe way Hosoda’s grandiose script retools “Beauty in the Beast” is equally transfixing. The basic building blocks, its visual odes to the fairy tale, certainly form a sturdy foundation. But Hosoda thoughtfully adds new, emotionally fertile soil to the vintage narrative. From it sprouts a difficult subject whereby the acute pain felt by the voiceless arises. Suzu must learn how her inner strength can also be her outer strength. And how her talent, apart from her spellbinding singing voice, resides in the empathy she shows, not in the popularity others give her.\n\nHosoda doesn’t offer a wholly new take on either the teenage romance format or online culture, and it's sometimes grating that Suzu must learn to embrace her sense of agency while making room for a love interest that equally believes in her fragility. But the captivating animation and the potent meditations on emotional and physical trauma give “Belle” an aching, gentle spirit worth experiencing.",
    "image_url": "https://resizing.flixster.com/KZJVINkZF7JdIaocIFsmbbR0ck8=/fit-in/180x240/v2/https://resizing.flixster.com/OZ-9-up1Gl3pHZhAo3NPm3OrPj4=/ems.ZW1zLXByZC1hc3NldHMvbW92aWVzL2FiMGE2NWNjLTNlMGItNDI3My1iMGU2LWNmM2VjMjQ5MDQ0ZC5qcGc="
  },
  {
    "id": 8,
    "movie_name": "THE LONG WALK",
    "movie_year": 2022,
    "movie_director": "Mattie Do",
    "movie_description": "This is a story full of pain, full of wounds. It doesn’t register as such at first. But it eventually provides its own full rationale by doing so.\n\n\"The Long Walk\" begins as a story that’s very hard to pin down. Filmed in Laos, directed by American-born director of Laotian extraction Mattie Do, from a script by Christopher Larsen (who’s written all of Do’s three features), it’s set in a Laos village surrounded by woodland. In those woodlands an unnamed old man scavenges for wires, abandoned tech detritus, and so on. When he gets on the dirt road that bifurcates the woodland we see a modern cityscape ahead on the horizon. But the movie never gets there.\n\nInstead the man goes into the village to sell his gatherings. As he walks, a young woman appears next to him. “Fifty years and you’ve never said a word,” he says of their time on the road together. The silent woman isn’t even herself 50, or 40.\n\nIn the village, the man needs to check something. He turns his arm and presses his wrist. From his skin a holographic read-out projects itself. The young shop clerk to whom he’s trying to pawn his woodland items laughs at him. “That the old government issue chip?” he laughs. “That must be a thousand years old.”\n\nFifty years, a thousand years: what time is now in this movie anyway? The question is only going to become more convoluted as the scenario reveals the old man has a body in his dwelling. Soon after that, a young woman approaches the man and asks if he can talk to spirits. A young boy is introduced into the story line. He finds a different body, one that is resurrected as ... the same woman who walks silently with the old man down the long road.\n\nIf you’re conversant with Chris Marker’s classic short film “La Jetée”—later expanded upon in a near-bombastic fashion in the Terry Gilliam feature “12 Monkeys”—you may have some idea of what’s going on here. But you only have some. Beyond its enigmatic and sometimes startling little frissons about the nature of time, “The Long Walk” also insists on poking the porous boundaries between science and the supernatural, or the spiritual. It also has plenty to sit with about the ideas of guilt and of responsibility, and the fact that it's set and shot in Laos means that it’s considering those themes on a world-historical level.\n\nYannawoutthi Chanthalungsy, as the old man, has a kind of settled unease that suggests the great American actor Robert Forster. You need only take in his grave face to know that his character is a man of secrets. Those secrets derive from what was his very misguided sense of duty, and it is when they come to light that the movie opens up the totality of its pain-filled world. This is a nuanced film, one that doesn’t lay itself out in what we would consider a satisfyingly linear fashion. But it’s the sort of thing that gets a grip on your spine when you’re least expecting it.\n\nNow playing in theaters and available on VOD on March 1.",
    "image_url": "https://resizing.flixster.com/CqG279O5ktWus9JFgyQ9EAMnGVQ=/fit-in/180x240/v2/https://resizing.flixster.com/nSUf6X6SuUlvOfLB-OxPIpEXvGU=/ems.ZW1zLXByZC1hc3NldHMvbW92aWVzL2IxZDczMzYyLWIzZWQtNDBlMC04ZTcwLThjOWI1YzYyNDE4Zi5qcGc="
  },
  {
    "id": 9,
    "movie_name": "TURNING RED",
    "movie_year": 2022,
    "movie_director": "Domee Shi",
    "movie_description": "Back in middle school, when she was barely a young teen, this critic had, ahem, a massive crush on a boy one year her senior.\n\nI can’t recall if we were already a couple when I foolishly filled my notebook with his name and some sappily romantic sentiments one evening, not knowing that the embarrassing pad would soon be discovered by my annoyingly overprotective detective of a mother. But I do remember sweating in shame, fear, confusion, and panic when she yanked the notebook from under me (in desperation, I sat on it to unsuccessfully hide the evidence of my young love) and started flipping the pages in utter shock and anger.\n\nNow imagine my astonishment during Oscar-winning “Bao” helmer Domee Shi’s masterful animation “Turning Red,” while I watched its 13-year-old central character undergo a similar episode with her own mother! The heroine in question is the overachieving Meilin (Rosalie Chiang)—Mei for her loved ones—growing up too fast with her budding hormones and changing body amid her Chinese-Canadian family in the Toronto of the early aughts. A slightly dorky straight-A student she may be, but there's nothing anyone could do to stop her from noticing all the good-looking boys—particularly a local store clerk—that she and her best friends frequently gush over. That anyone includes her disciplined, willowy mother Ming (Sandra Oh), who discovers Mei’s notebook of suggestive heartthrob drawings in furious disbelief. What’s Mei to do if not literally turn red and POOF, transform into a furry, monstrously cute red panda in the midst of navigating all these intense emotions? (Why hadn't I thought of this when I was similarly busted? And more importantly, where was this movie when I was growing up?)\n\nAnd that is the genius of “Turning Red,” a radical, brazenly hormonal PG movie that instantly fills a huge void in the lives of awkward, novel female teens who might just be starting to crawl out of their childhood cocoons with a disharmony of mystifying awakenings and sexual feelings. That achievement is perhaps no surprise coming from Pixar, a studio that can always be trusted for a generous dose of reflective, grown-up nostalgia as well as a good old-fashioned coming-of-age saga. After all, weren’t some of the best characters of the fiercely inventive animation house—from the talking dolls of the “Toy Story” franchise to the corporeal feelings of “Inside Out,” the rebellious princess of “Brave,” and the aspiring young musician of “Coco”—gloriously defined by its signature preoccupations? Still, “Turning Red” (which deserves a lot better than the straight-to-streaming fate Disney has bestowed upon it) feels pioneering and surprising even for the shop behind the groundbreaking animated sci-fi “WALL-E.” For starters, never before has a Disney female ever been asked, “Has the red peony blossomed?” as an inquiry about the start of her menstruation. \n\nIn that regard, “Turning Red” is both a triumphant thematic homecoming for the company and a welcome outlier within the Pixar canon that is, exceptions aside, typically over-flooded with male-centric narratives. What’s even greater about it is its recognizable foundation carrying shades of various superhero tales and the likes of “Teen Wolf” (the 1985 one). You know, stories in which boys and men hide behind their alter-egos while they make sense of the new eyes through which they see the world. Written by Shi and Julia Cho, “Turning Red” passes this familiar baton to Mei, unearthing something that is both culturally specific and universal through its Chinese-Canadian protagonist clearly fashioned by the co-scribes with heaps of personal memories and loving insights.\n\nIt’s certainly a delight to follow Mei once she discovers her inner red panda and figures out that as long as she keeps a cool and collected demeanor sans emotions with a little help from her friends, the pink brute won’t take over. Who knows, she could perhaps even lead a normal life and even have some fun along the way. But that’s easier said than done when you’re a teenage girl defined by your wobbly mood swings and the time you spend with your equally frenzied group of friends. In Mei’s case, her girlhood clan consists of the sharp-tongued Abby (Hyein Park), nonconformist Miriam (Ava Morse), and the nonchalant Priya (Maitreyi Ramakrishnan). Together, the celebrated quartet swing from one trouble to the next, trying to do everything they can to see their dreamy boy band 4*Town in concert. (The five-member band does have some actual bangers in the film, written by Billie Eilish and Finneas O’Connell.) But with Mei’s plush red panda slightly altering their plans, the friends finds themselves at a crossroads that directly concerns the young Mei’s future.\n\nAs it turns out, Mei had been cursed with a spell passed on through the generations of women in her family. And it can only be broken if she willingly participates in a strenuous ritual that would keep her nuisance alter-ego safely tucked away forever. Through this dilemma, Shi beautifully constructs a traditional tale of generational clash between Mei and her mother, filling their unity and contradictions with thoughtful details of their urban life: the family temple they run as a tourist attraction, the elaborate, studiously cooked meals, the domestic support that runs deep within their household. The animation style—infused with traditional motifs, interludes of anime, and a zippy energy—rises to the occasion, vividly painting Mei’s world with the same level of intricacy Shi and Cho conjure up on the page. While the film’s slightly bloated finale overpowers some of the leaner moments that come before it, “Turning Red” flickers with a bright feminine spirit, one that feels new, crimson-deep, and unapologetically rebellious.\n\nOn Disney+ on Friday, March 11th.",
    "image_url": "https://resizing.flixster.com/j6LoLBfccvNZnA5wE_OU6XJLj00=/fit-in/180x240/v2/https://resizing.flixster.com/RqaXyhMK5ardZIZqR3gOQhcXRow=/ems.ZW1zLXByZC1hc3NldHMvbW92aWVzLzkyNjlmYjNjLWFlY2ItNGJjNi1iNDk2LTY4NGJiMDBjZGUyMS5qcGc="
  },
  {
    "id": 10,
    "movie_name": "THE FALLOUT",
    "movie_year": 2022,
    "movie_director": "Megan Park",
    "movie_description": "Jenna Ortega has a star-making turn in “The Fallout,” a high school drama that explores a teenager’s emotional turmoil following a school shooting.\n\nThe film conjured up by that sentence may sound maudlin, preachy or, frankly, unoriginal, but what this debut feature from Megan Park gets right is how painfully awkward and strange the effects of trauma can often be, especially when experienced by a group of adolescents. Ortega portrays Vada, a self-proclaimed “chill” 16-year-old who, during the shooting, finds herself hiding in the bathroom with fellow students Mia (Maddie Ziegler) and Quinton (Niles Fitch). This shared experience leads Vada to form intense and confusing relationships with both of them, even as she grows distant from her parents (Julie Bowen and John Ortiz), her younger sister, Amelia (Lumi Pollack), and her best friend, Nick (Will Ropp), who channels his trauma into activism and doesn’t understand why Vada wouldn’t do the same.\n\n\nOrtega nails her role as a levelheaded teen who, nevertheless, is still a teen, reeling from an unthinkable event on top of the usual growing pains. Her impulsive, bizarre and, yes, even funny outbursts as she tries to reckon with the shooting paint a grounded and compassionate picture of adolescent grief. Her onscreen chemistry with Fitch and especially Ziegler strikes that same delicate balance, as do Vada’s conversations with her school therapist (a briefly seen but very good Shailene Woodley).\n\nPark emphasizes the realism with her low-key yet stylish direction, ranging from small details (a Black Lives Matter sign hanging in a suburban window) to poetic shots that highlight how much the film is centered on the Gen Z experience (two teens wearing face masks and smoking blunts in a hot tub; a girl practicing a TikTok dance while her sister texts in the foreground). As one might expect from a work that revolves around coping with current events, not everything in Vada’s life has been neatly resolved by the film’s conclusion. After all, trauma never really goes away; it grows and evolves, just like the people who carry it.",
    "image_url": "https://resizing.flixster.com/u1dnT5pm8Z3tfsXKSf2eyG4y6eM=/fit-in/180x240/v2/https://resizing.flixster.com/MjTsLV3dGrwG2Qt9a3QOFHJlOpo=/ems.ZW1zLXByZC1hc3NldHMvbW92aWVzLzQyN2E5MzAzLTNkMTgtNDkwYS1hYjk2LTg1Y2U2NGRkYzcxYy5qcGc="
  }
]